In [1]:
# Benodigde packages

import json            # Package om .json files in te laden (bvb kolomnamen zijn zo opgeslagen)
import getpass         # Package om een paswoordveldje te genereren.
import mysql.connector # MySQL package
import numpy as np
import os
import pandas as pd    # Populaire package voor data-verwerking
import sys
from basics import*

sys.version_info       # Check python versie, wij veronderstellen 3.6

sys.version_info(major=3, minor=6, micro=4, releaselevel='final', serial=0)

In [2]:
def verbind_met_GB(username, hostname, gegevensbanknaam):
    """
    Maak verbinding met een externe gegevensbank
    
    :param  username:          username van de gebruiker, string
    :param  hostname:          naam van de host, string.
                               Dit is in het geval van een lokale server gewoon 'localhost'
    :param  gegevensbanknaam:  naam van de gegevensbank, string.
    :return connection:        connection object, dit is wat teruggeven wordt 
                               door connect() methods van packages die voldoen aan de DB-API
    """
    
    password = getpass.getpass() # Genereer vakje voor wachtwoord in te geven
    
    connection = mysql.connector.connect(host=hostname,
                                         user=username,
                                         passwd=password,
                                         db=gegevensbanknaam)
    return connection


def run_query(connection, query):
    """
    Voer een query uit op een reeds gemaakte connectie, geeft het resultaat van de query terug
    """
    
    # Making a cursor and executing the query
    cursor = connection.cursor()
    cursor.execute(query)
    
    # Collecting the result and casting it in a pd.DataFrame
    res = cursor.fetchall()
    
    return res


def res_to_df(query_result, column_names):
    """
    Giet het resultaat van een uitgevoerde query in een 'pandas dataframe'
    met vooraf gespecifieerde kolomnamen.
    
    Let op: Het resultaat van de query moet dus exact evenveel kolommen bevatten
    als kolomnamen die je meegeeft. Als dit niet het geval is, is dit een indicatie
    dat je oplossing fout is. (Gezien wij de kolomnamen van de oplossing al cadeau doen)
    
    """
    df = pd.DataFrame(query_result, columns=column_names)
    return df

In [3]:
# Dictionary van kolomnamen inladen

filename = os.path.join(os.getcwd(), 'solution', 'all_q_colnam.json')
col_names = json.load(open(filename, 'r'))    

col_names # Inspecteer dictionary

{'query_01': ['tname', 'year', 'HomeRun'],
 'query_02': ['nameFirst', 'nameLast', 'birthYear', 'birthMonth', 'birthDay'],
 'query_03': ['nameFirst', 'nameLast', 'tname'],
 'query_04': ['tname', 'rank', 'W', 'L', 'nameFirst', 'nameLast'],
 'query_05': ['tname'],
 'query_06': ['tname', 'yearID', 'rank', 'W', 'L'],
 'query_07': ['nameLast', 'nameFirst'],
 'query_08': ['birthState',
  'avg_weight',
  'avg_height',
  'avg_HomeRun',
  'avg_Saves'],
 'query_09': ['yearID', 'tname', 'HomeRun'],
 'query_10': ['yearID', 'tname', 'rank', 'Games']}

In [4]:
def query_01(connection, column_names):
    # Bouw je query
    query="""
    SELECT t.name, t.yearID, t.HR
    FROM   Teams as t
    ORDER by t.HR DESC;
    """
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [5]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

········

In [6]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_01'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_01(c, col_names['query_01'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df.head()

               tname  year  HomeRun
0   Seattle Mariners  1997      264
1      Texas Rangers  2005      260
2  Baltimore Orioles  1996      257
3  Toronto Blue Jays  2010      257
4  Baltimore Orioles  2016      253

In [28]:
def query_02(connection, column_names, datum = '1980-01-16'):
    # Bouw je query
    query="""
    SELECT Master.nameFirst, Master.nameLast, 
           Master.birthYear, Master.birthMonth, Master.birthDay
    FROM   Master
    WHERE  Master.debut> {}
    ORDER by Master.nameLast;
    """.format(datum)
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [29]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

········

In [30]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_02'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_02(c, col_names['query_02'], datum = '1980-01-16')

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df.head()

  nameFirst nameLast  birthYear  birthMonth  birthDay
0     David  Aardsma       1981          12        27
1       Don     Aase       1954           9         8
2      Andy     Abad       1972           8        25
3  Fernando     Abad       1985          12        17
4     Glenn   Abbott       1951           2        16

In [10]:
def query_03(connection, column_names):
    # Bouw je query
    query="""
    SELECT DISTINCT MS.nameFirst, MS.nameLast, t.name
    FROM   Teams as t, Managers as MG, Master as MS
    WHERE  MG.teamID = t.teamID AND MG.plyrMgr = 'N'
           AND MS.playerID = MG.playerID
    ORDER by t.name;
    """
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [11]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

········

In [12]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_03'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_03(c, col_names['query_03'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df.head()

  nameFirst  nameLast                  tname
0        Ed    Curtis  Altoona Mountain City
1      Mike  Scioscia         Anaheim Angels
2     Terry   Collins         Anaheim Angels
3       Joe    Maddon         Anaheim Angels
4      Chip      Hale   Arizona Diamondbacks

In [37]:
def query_04(connection, column_names, datum_x='1980-01-01', datum_y='1980-01-01'):
    # Bouw je query
    query="""
    SELECT DISTINCT t.name, t.Rank, t.W, t.L, MS.nameFirst, MS.nameLast
    FROM   Teams as t, Managers as MG, Master as MS, Halloffame as HF
    WHERE  MS.playerID = MG.playerID AND HF.playerID = MG.playerID
           AND MG.teamID = t.teamID
           AND HF.yearid > {}
           AND MG.yearID < {}
    ORDER by t.name, t.Rank;
    """.format(datum_x, datum_y)
    ####hoe variablen binnen krijgen 
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [38]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

········

In [39]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_04'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_04(c, col_names['query_04'], datum_x='1980-01-01', datum_y='1980-01-01')

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

                    tname  rank    W    L nameFirst nameLast
0          Atlanta Braves     1  101   59     Bobby      Cox
1          Atlanta Braves     1   90   72     Bobby      Cox
2          Atlanta Braves     1   89   73     Bobby      Cox
3          Atlanta Braves     1   93   69     Bobby      Cox
4          Atlanta Braves     1   94   68     Bobby      Cox
5          Atlanta Braves     1   98   64     Bobby      Cox
6          Atlanta Braves     1  104   58     Bobby      Cox
7          Atlanta Braves     1   90   54     Bobby      Cox
8          Atlanta Braves     1   96   66     Bobby      Cox
9          Atlanta Braves     1  101   61     Bobby      Cox
10         Atlanta Braves     1  106   56     Bobby      Cox
11         Atlanta Braves     1  103   59     Bobby      Cox
12         Atlanta Braves     1   95   67     Bobby      Cox
13         Atlanta Braves     1   88   74     Bobby      Cox
14         Atlanta Braves     2   88   74     Bobby      Cox
15         Atlanta Braves     2   80   82     Bobby      Cox
16         Atlanta Braves     2   91   71     Bobby      Cox
17         Atlanta Braves     2   89   73     Bobby      Cox
18         Atlanta Braves     2   94   68     Bobby      Cox
19         Atlanta Braves     2   79   83     Bobby      Cox
20         Atlanta Braves     2   68   46     Bobby      Cox
21         Atlanta Braves     3   79   83     Bobby      Cox
22         Atlanta Braves     3   84   78     Bobby      Cox
23         Atlanta Braves     3   86   76     Bobby      Cox
24         Atlanta Braves     3   82   80     Bobby      Cox
25         Atlanta Braves     3   88   74     Bobby      Cox
26         Atlanta Braves     4   72   90     Bobby      Cox
27         Atlanta Braves     4   67   95     Bobby      Cox
28         Atlanta Braves     4   70   84     Bobby      Cox
29         Atlanta Braves     4   81   80     Bobby      Cox
...                   ...   ...  ...  ...       ...      ...
3305        Texas Rangers     3   77   85    Whitey   Herzog
3306        Texas Rangers     3   85   77    Whitey   Herzog
3307        Texas Rangers     3   74   70    Whitey   Herzog
3308        Texas Rangers     4   71   91    Whitey   Herzog
3309        Texas Rangers     4   76   86    Whitey   Herzog
3310        Texas Rangers     4   73   89    Whitey   Herzog
3311        Texas Rangers     4   72   90    Whitey   Herzog
3312        Texas Rangers     4   76   85    Whitey   Herzog
3313        Texas Rangers     4   75   87    Whitey   Herzog
3314        Texas Rangers     4   83   79    Whitey   Herzog
3315        Texas Rangers     4   77   85    Whitey   Herzog
3316        Texas Rangers     5   67   95    Whitey   Herzog
3317        Texas Rangers     6   57  105    Whitey   Herzog
3318        Texas Rangers     6   64   98    Whitey   Herzog
3319        Texas Rangers     6   75   87    Whitey   Herzog
3320        Texas Rangers     6   70   91    Whitey   Herzog
3321        Texas Rangers     6   54  100    Whitey   Herzog
3322        Texas Rangers     7   69   92    Whitey   Herzog
3323        Texas Rangers     7   62   99    Whitey   Herzog
3324  Washington Senators     4   86   76       Gil   Hodges
3325  Washington Senators     5   63   96       Gil   Hodges
3326  Washington Senators     6   70   92       Gil   Hodges
3327  Washington Senators     6   76   85       Gil   Hodges
3328  Washington Senators     8   70   92       Gil   Hodges
3329  Washington Senators     8   71   88       Gil   Hodges
3330  Washington Senators     9   61  100       Gil   Hodges
3331  Washington Senators     9   62  100       Gil   Hodges
3332  Washington Senators    10   60  101       Gil   Hodges
3333  Washington Senators    10   56  106       Gil   Hodges
3334  Washington Senators    10   65   96       Gil   Hodges

[3335 rows x 6 columns]

In [50]:
def query_05(connection, column_names):
    # Bouw je query
    query="""
    SELECT DISTINCT t.name
    FROM   Teams as t
    WHERE  (SELECT  COUNT(*)
            FROM    Teams as t, Managers as MG
            WHERE   t.yearID>'1980-01-01'
                    AND MG.teamID = T.teamID AND MG.plyrMgr = 'Y')>=1;
    """
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [51]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

········

In [52]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_05'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_05(c, col_names['query_05'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

                             tname
0             Boston Red Stockings
1          Chicago White Stockings
2           Cleveland Forest Citys
3             Fort Wayne Kekiongas
4                 New York Mutuals
5           Philadelphia Athletics
6            Rockford Forest Citys
7                   Troy Haymakers
8              Washington Olympics
9               Baltimore Canaries
10               Brooklyn Eckfords
11              Brooklyn Atlantics
12           Middletown Mansfields
13            Washington Nationals
14             Baltimore Marylands
15             Elizabeth Resolutes
16             Philadelphia Whites
17            Washington Blue Legs
18             Hartford Dark Blues
19                 Keokuk Westerns
20             New Haven Elm Citys
21        Philadelphia Centennials
22         St. Louis Red Stockings
23       St. Louis Brown Stockings
24                 Boston Red Caps
25                 Cincinnati Reds
26                Louisville Grays
27              Indianapolis Blues
28                 Milwaukee Grays
29                Providence Grays
..                             ...
109                    Boston Bees
110         Philadelphia Blue Jays
111               Milwaukee Braves
112             Cincinnati Redlegs
113          Kansas City Athletics
114            Los Angeles Dodgers
115           San Francisco Giants
116             Los Angeles Angels
117                Minnesota Twins
118             Houston Colt .45's
119                  New York Mets
120              California Angels
121                 Houston Astros
122                 Atlanta Braves
123              Oakland Athletics
124             Kansas City Royals
125                 Montreal Expos
126               San Diego Padres
127                 Seattle Pilots
128                  Texas Rangers
129               Seattle Mariners
130              Toronto Blue Jays
131               Colorado Rockies
132                Florida Marlins
133                 Anaheim Angels
134           Arizona Diamondbacks
135           Tampa Bay Devil Rays
136  Los Angeles Angels of Anaheim
137                 Tampa Bay Rays
138                  Miami Marlins

[139 rows x 1 columns]

In [25]:
def query_06(connection, column_names, salaris=200000):
    # Bouw je query
    query="""
    SELECT t.name, t.YearID, t.Rank, t.W, t.L
    FROM   Teams as t, Salaries as S
    GROUP BY t.teamID
    HAVING {} < ALL(SELECT S.salary
            FROM Teams as t, Salaries as S
            WHERE t.yearID = S.yearID AND t.teamID = S.teamID);
    """.format(salaris)
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [26]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

········

In [27]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_06'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_06(c, col_names['query_06'], salaris=200000)

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

Empty DataFrame
Columns: [tname, yearID, rank, W, L]
Index: []

In [40]:
def query_07(connection, column_names):
    # Bouw je query
    query="""
    SELECT DISTINCT MS.nameLast, MS.nameFirst
    FROM  Managers as MG, Master as MS, Awardsmanagers as AM
    
    WHERE MG.playerID = MS.playerID AND MS.playerID = AM.playerID
    GROUP BY AM.playerID
    HAVING COUNT(DISTINCT AM.awardID)=2

    ORDER by MS.nameLast;
    """
    #    AND   AM.awardID LIKE '%SN%'  
    # AND   AM.awardID LIKE '%BW%' 

    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [41]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

········

In [43]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_07'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_07(c, col_names['query_07'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

      nameLast nameFirst
0         Alou    Felipe
1     Anderson    Sparky
2        Baker     Dusty
3       Baylor       Don
4        Black     Buddy
5        Bochy     Bruce
6         Bowa     Larry
7          Cox     Bobby
8         Frey       Jim
9   Gardenhire       Ron
10      Gibson      Kirk
11     Girardi       Joe
12     Guillen     Ozzie
13      Herzog    Whitey
14      Hurdle     Clint
15     Johnson     Davey
16       Kelly       Tom
17      Lanier       Hal
18     LaRussa      Tony
19     Leyland       Jim
20      Maddon       Joe
21      Manuel     Jerry
22    McNamara      John
23      Melvin       Bob
24       Oates    Johnny
25        Pena      Tony
26    Piniella       Lou
27    Robinson     Frank
28     Rodgers      Buck
29    Scioscia      Mike
30   Showalter      Buck
31     Torborg      Jeff
32       Torre       Joe
33       Tracy       Jim
34       Wedge      Eric
35    Williams      Jimy
36    Williams      Matt
37      Zimmer       Don

In [ ]:
def query_08(connection, column_names, jaar=1990, lengte=75):
    # Bouw je query
    query="""
    SELECT   MS.birthState, AVG(MS.weight), AVG(MS.height),
             AVG(B.HR), AVG(P.SV)
    FROM     Master as MS, Batting as B, Pitching as P
    WHERE    AVG(SELECT MS.Height
                 FROM   Master as MS, Halloffame as HF
                 WHERE  HF.yearID >= {} AND
                        MS.playerID = HF.playerID) > {}
    GROUP BY MS.birthState
    ORDER BY MS.birthState;
    """.format(jaar,lengte)
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [ ]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

In [ ]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_08'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_08(c, col_names['query_08'], jaar=1990, lengte=75)

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

In [ ]:
def query_09(connection, column_names, jaar=1975):
    # Bouw je query
    query="""
    SELECT t.Yearid, t.name, t.HR
    FROM Team as t
    WHERE t.YearID = {} AND t.HR = MIN(t.HR)
    IN (SELECT TOP 2 *
    FROM Teams as t
    ORDER BY t.HR)
    """.format(jaar)
    
    # Stap 2 & 3
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [ ]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

In [ ]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_09'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_09(c, col_names['query_09'])

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df

In [3]:
def query_10(connection, column_names, jaar=1990):
    # Bouw je query
    
    query="""
    SELECT t.yearID, t.name, t.Rank, t.G
    FROM   Teams as t, Appearances as A
    WHERE  t.teamID = A.teamID AND t.yearID={}
           AND (SELECT  COUNT(DISTINCT AP.playerID)
                FROM    Appearances as A, Awardsplayers as AP, Teams as t
                WHERE   A.teamID = t.teamID AND A.playerID = AP.playerID AND T.yearID= {}
                        AND (SELECT COUNT(*)
                             FROM   Appearances as A, Awardsplayers as AP, Teams as t
                             WHERE  A.teamID = t.teamID AND t.yearID= {}
                             AND    AP.playerID in (SELECT  A.playerID 
                                                     FROM   Appearances as A, Teams as t
                                                     WHERE  A.teamID = t.TeamID)                 
                       )=1)>0;
    ORDER by t.name, t.Rank
    """.format(jaar,jaar,jaar)
    res = run_query(connection, query)         # Query uitvoeren
    df = res_to_df(res, column_names)          # Query in DataFrame brengen
    
    return df

In [ ]:
username = 'root'      # Vervang dit als je via een andere user queries stuurt
hostname = 'localhost' # Als je een databank lokaal draait, is dit localhost.
db = 'lahman2016'      # Naam van de gegevensbank op je XAMPP Mysql server

# We verbinden met de gegevensbank
c = verbind_met_GB(username, hostname, db)

In [ ]:
# De voorbeeldquery heeft dezelfde kolomnamen als query 1, dus we gebruiken die
kolommen = col_names['query_10'] 

# Functie uitvoeren, geeft resultaat van de query in een DataFrame
df = query_10(c, col_names['query_10'], jaar=1990)

# We inspecteren de eerste paar resultaten (voor alles te zien: laat .head() weg)
df.head()